# 1

a = int(input("Number: "))
if -100 <= a <= 100 and a != 0:
    print("Yes")
else:
    print("No")

# 2

year = int(input("Year: "))
if year % 4 == 0 or year % 400 == 0 and year % 100 != 0:
    print("Yes")
else:
    print("No")

# 3 method 1

days = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"]
day = input("Day: ").title()
hour = int(input("Hour: "))
if day not in days and day != "Sunday":
    print(f"Invalid day '{day}'")
    exit()
if day in days and 10 <= hour <= 18:
    print("Open")
else:
    print("Closed")

# 3 method 2

day = input("Day: ").title()
hour = int(input("Hour: "))
match day:
    case "Monday" | "Tuesday" | "Wednesday" | "Thursday" | "Friday" | "Saturday":
        if 10 <= hour <= 18:
            print("Open")
        else:
            print("Closed")
    case "Sunday":
        print("Closed")
    case _:
        print(f"Invalid day '{day}'")


# 4

a = int(input("Температура: "))
if a < 0:
    print("Студено")
elif 0 <= a <= 25:
    print("Умерено")
else:
    print("Топло")

# 5

country = input("Въведете държава за доставка: ").title()
num = int(input("Въведете сума: "))

allcntry = [
    "Австралия", "Австрия", "Азербайджан", "Аландски острови", "Албания", \
    "Алжир", "Американска Самоа", "Американски Вирджински острови", "Англия", "Ангола", \
    "Ангуила", "Андора", "Антарктика", "Антигуа и Барбуда", "Аржентина", \
    "Армения", "Аруба", "Афганистан", "Бангладеш", "Барбадос", \
    "Бахамски острови", "Бахрейн", "Беларус", "Белгия", "Белиз", \
    "Бенин", "Бермудски острови", "Боливия", "Босна и Херцеговина", "Ботсвана", \
    "Бразилия", "Британска територия в Индийския океан", "Британски Вирджински острови", "Бруней Даруссалам", "Кот д'Ивоар", \
    "Буве", "Буркина Фасо", "Бурунди", "Бутан", "България", \
    "Вануату", "Ватикана", "Венецуела", "Виетнам", "Габон", \
    "Гамбия", "Гана", "Гаяна", "Гваделупа", "Гватемала", \
    "Гвинея", "Гвинея-Бисау", "Германия", "Гибралтар", "Гренада", \
    "Гренландия", "Грузия", "Гуам", "Гърнси", "Гърция", \
    "Дания", "Демократична република Конго (Заир)", "Джибути", "Джърси", "Доминика", \
    "Доминиканска република", "Египет", "Еквадор", "Екваториална Гвинея", "Ел Салвадор", \
    "Еритрея", "Естония", "Етиопия", "Замбия", "Западна Сахара", \
    "Зимбабве", "Йемен", "Израел", "Източен Тимор", "Индия", \
    "Индонезия", "Йордания", "Ирак", "Иран", "Ирландия", \
    "Исландия", "Испания", "Италия", "Кабо Верде (острови Зелени Нос)", "Казахстан", \
    "Каймански острови", "Камбоджа", "Камерун", "Канада", "Карибска Холандия", \
    "Катар", "Кения", "Кипър", "Киргизстан", "Кирибати", \
    "Китай", "Кокосови острови", "Коледни острови", "Колумбия", "Коморски острови", \
    "Конго", "Коста Рика", "Куба", "Кувейт", "Кюрасао", \
    "Лаос", "Латвия", "Лесото", "Либерия", "Либия", \
    "Ливан", "Литва", "Лихтенщайн", "Люксембург", "Мавритания", \
    "Мавриций", "Мадагаскар", "Майот", "Макао", "Македония", \
    "Малави", "Малайзия", "Малдиви", "Мали", "Малта", \
    "Ман (остров),", "Мароко", "Мартиника", "Маршалови острови", "Мексико", \
    "Мианмар", "Микронезия", "Мозамбик", "Молдова", "Монако", \
    "Монголия", "Монсерат", "Намибия", "Науру", "Непал", \
    "Нигер", "Нигерия", "Никарагуа", "Ниуе", "Нова Зеландия", \
    "Нова Каледония", "Норвегия", "Норфолк (остров),", "Обединени арабски емирства", "Оман", \
    "Острови Кук", "Острови Хърд и Макдоналд", "Пакистан", "Палау", "Палестина", \
    "Панама", "Папуа Нова Гвинея", "Парагвай", "Перу", "Питкерн", \
    "Полша", "Португалия", "Пуерто Рико", "Реюнион", "Руанда", \
    "Румъния", "Русия", "Самоа", "Сан марино", "Сао Томе и Принсипи", \
    "Саудитска Арабия", "САЩ", "Свазиленд", "Свалбард и Ян Майен", "Света Елена (остров)", \
    "Северна Корея", "Северни Мариански острови", "Сейнт Бартс", "Сейнт Винсент и Гренадини", "Сейнт Китс и Невис", \
    "Сейнт Лусия", "Сейшели", "Сен Мартен (Франция)", "Сен Пиер и Микелон", "Сенегал", \
    "Сиера Леоне", "Сингапур", "Синт Мартен (Холандия)", "Сирия", "Словакия", \
    "Словения", "Соломонови острови", "Сомалия", "Судан", "Суринам", \
    "Сърбия", "Таджикистан", "Тайван", "Тайланд", "Танзания", \
    "Того", "Токелау", "Тонга", "Тринидад и Тобаго", "Тувалу", \
    "Тунис", "Туркменистан", "Турция", "Търкс и Кайкос", "Уганда", \
    "Узбекистан", "Украйна", "Унгария", "Уолис и Футуна", "Уругвай", \
    "Фарьорски острови", "Фиджи", "Филипини", "Финландия", "Фолкландски острови", \
    "Франция", "Френска Полинезия", "Френски южни и антарктически територии", "Фреска Гвиана", "Хаити", \
    "Холандия", "Хондурас", "Хонконг", "Хърватска", "Централноафриканска република", \
    "Чад", "Черна гора", "Чехия", "Чили", "Швейцария", \
    "Швеция", "Шри Ланка", "ЮАР", "Южен Судан", "Южна Джорджия и Южни Сандвичеви острови", \
    "Южна Корея", "Ямайка", "Япония"
   ]

allcntrylower = [x.lower() for x in allcntry]

match country:
    case "Албания" | "Андора" | "Австрия" | "Белгия" | "Босна И Херцеговина" \
          | "Ватикана" | "Великобритания" | "Германия" | "Гърция" \
          | "Дания" | "Естония" | "Ирландия" | "Исландия" | "Испания" | "Италия" \
          | "Кипър" | "Латвия" | "Литва" | "Лихтенщайн" | "Люксембург" | "Северна Македония" \
          | "Малта" | "Молдова" | "Монако" | "Нидерландия" | "Норвегия" | "Полша" | "Португалия" \
          | "Румъния" | "Русия" | "Сан Марино" | "Словакия" | "Словения" | "Сърбия" \
          | "Украйна" | "Унгария" | "Финландия" | "Франция" | "Хърватия" | "Черна гора" \
          | "Чехия" | "Швейцария" | "Швеция" | "Шотландия" | "Ирландия":
        print("Крайна сума: {p:.2f} лева".format(p = (num * 0.05) + num))
    case "България":
        print("Крайна сума: {p:.2f} лева".format(p = (num * 0.02) + num))
    case _:
        if country.lower() in allcntrylower:
            print("Крайна сума: {p:.2f} лева".format(p = (num * 0.10) + num))
        else:
            print("Невалидно име на държава!")